# initialize
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'

brew 'ctags'
brew 'git'
brew 'lua'
brew 'luajit'
brew 'macvim', args: ['with-features=huge', 'enable-multibyte', 'with-macarchs=x86_64', 'enable-perlinterp', 'enable-rubyinterp', 'enable-tclinterp', 'with-ruby-co', 'with-custom-icons', 'with-override-system-vim', 'with-lua', 'with-luajit']
brew 'nvm'
brew 'openssl'
brew 'rbenv'
brew 'ruby-build'
brew 'the_silver_searcher'
brew 'wget'
brew 'zsh'

#PeerStreet
brew 'imagemagick@6'
brew 'heroku/brew/heroku'

brew 'redis', restart_service: true
brew 'postgresql', restart_service: true

cask 'appcleaner'
cask 'dash'
cask 'dropbox'
cask 'google-chrome'
# cask 'google-drive'
cask 'gpgtools'
cask 'iterm2'
cask 'sourcetree'
cask 'spotify'
cask 'viscosity'
cask 'encryptme'
cask 'aerial'
cask 'karabiner-elements'

cask 'font-inconsolata'
